{
  "backend/main.mo": "Empty Motoko actor with no functionality implemented.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: global white/yellow color theme update and card background colors across all pages.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the 8-page React application with TanStack Router, yellow/white theme, and card components with varied background colors.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color variables for light and dark modes, using grayscale values (no yellow theme applied here).",
  "frontend/index.html": "HTML entry point for the ARS Consulting Website React application.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with 8 routes (Home, About, Services, GCC, Industries, Insights, Careers, Contact) and shared Header/Footer layout.",
  "frontend/src/components/Footer.tsx": "Footer component with company info, navigation links, LinkedIn social link, copyright notice, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Header.tsx": "Responsive navigation header with logo, desktop/mobile menus, and active route highlighting for all 8 pages.",
  "frontend/src/hooks/useActor.ts": "React hook for managing ICP backend actor instances with authentication support, automatically invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future React Query hooks when backend functionality is added.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a white and yellow professional theme, including light/dark mode color schemes for UI components, cards, charts, and borders.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/About.tsx": "About page component displaying company story, mission/vision cards, and leadership team section with hero banner and multiple content sections using custom card color variants.",
  "frontend/src/pages/Careers.tsx": "Careers page component featuring company benefits list, open job positions with details, and an application form with file upload functionality for candidate submissions.",
  "frontend/src/pages/Contact.tsx": "Contact page component with a contact form for inquiries and a section displaying company contact information including email, phone, location, and LinkedIn.",
  "frontend/src/pages/GCC.tsx": "Global Capability Centers service page showcasing GCC benefits, a three-phase approach (Assess, Setup, Scale) with detailed steps, and call-to-action for consultation.",
  "frontend/src/pages/Home.tsx": "Homepage component with hero section, services overview (GCC, AI transformation, talent, delivery), company differentiators, industries served, and engagement process steps.",
  "frontend/src/pages/Industries.tsx": "Industries page component displaying five industry verticals (Banking, Healthcare, Retail, Technology, Manufacturing) with icons, descriptions, and key capabilities in colored card layouts.",
  "frontend/src/pages/Insights.tsx": "Insights page component showing thought leadership articles across four categories (GCC Trends, AI in Enterprises, Global Delivery Strategy, Talent Market Insights) with filtering badges and article metadata.",
  "frontend/src/pages/Services.tsx": "Services page component presenting four core service offerings (GCC, AI Transformation, Talent, Managed Delivery) with icons and detailed capability lists in colored cards.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space, including card color variants (yellow, amber, warm, light), extended typography, and container settings.",
  "project_state.json": "Project state tracking document for ARS Consulting website, listing architectural notes, existing features (home page sections, about page, services, industries), and multi-page structure with B2B enterprise focus."
}